---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.FamilyDoesntMatchSystemPropertiesWasDisconnected
source: html/c9a522bf-4c30-2c2d-e9fb-5d4acd612883.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.FamilyDoesntMatchSystemPropertiesWasDisconnected Property

The family no longer matches the properties for the System. Disconnect the family from the System?

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyDoesntMatchSystemPropertiesWasDisconnected { get; }
```